# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].

data = [int(i) for i in input("Введите числа через пробел: ").split()]
x=int(input("Введите число X: "))
count=0
for i in data:
    if i==x:
        count+=1
print(f"Число {x} встречается {count} раз.")


# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.

data = [int(i) for i in input("\nВведите числа через пробел: ").split()]
x=int(input("Введите число X: "))
diff=abs(data[0]-x)
elem=data[0]
for i in data:
    if abs(i-x)<diff:
        diff=abs(i-x)
        elem=i
print(f"Самым близким к {x} числом является число {elem}.")


# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков. 
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка; Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; 
# Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.
# *Пример:*
# ноутбук
#     12

dict={'AEIOULNSTR': 1, 'DG': 2, 'BCMP': 3, 'FHVWY': 4, 'K': 5, 'JX': 8, 'QZ': 10,
      'АВЕИНОРСТ': 1, 'ДКЛМПУ': 2, 'БГЁЬЯ': 3, 'ЙЫ': 4, 'ЖЗХЦЧ': 5, 'ШЭЮ': 8, 'ФЩЪ': 10}

word=input("\nВведите слово: ")
summ=0
for i in word:
    for key in dict:
        if i.upper() in key:
            summ+=dict[key]
print(f'Стоимость слова равна:{summ}')